<a href="https://colab.research.google.com/github/hyunicecream/Inflearn/blob/main/1_11_apply_%ED%95%A8%EC%88%98_%ED%99%9C%EC%9A%A9.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd

In [ ]:
date_list = [{'yyyy-mm-dd': '2000-06-27'},
         {'yyyy-mm-dd': '2002-09-24'},
         {'yyyy-mm-dd': '2005-12-20'}]
df = pd.DataFrame(date_list, columns = ['yyyy-mm-dd'])
df

   yyyy-mm-dd
0  2000-06-27
1  2002-09-24
2  2005-12-20

In [ ]:
def extract_year(column):
  return column.split("-")[0]

In [ ]:
df['year'] = df['yyyy-mm-dd'].apply(extract_year)

In [ ]:
df

   yyyy-mm-dd  year
0  2000-06-27  2000
1  2002-09-24  2002
2  2005-12-20  2005

In [ ]:
def get_age(year, current_year):
  return current_year - int(year)

In [ ]:
df['age'] = df['year'].apply(get_age, current_year=2021)

In [ ]:
df

   yyyy-mm-dd  year  age
0  2000-06-27  2000   21
1  2002-09-24  2002   19
2  2005-12-20  2005   16

In [ ]:
def get_introduce(age, prefix, suffix):
  return prefix + str(age) + suffix

In [ ]:
df['introduce'] = df['age'].apply(get_introduce, prefix="I'm ", suffix=" years old")

In [ ]:
df

   yyyy-mm-dd  year  age         introduce
0  2000-06-27  2000   21  I'm 21 years old
1  2002-09-24  2002   19  I'm 19 years old
2  2005-12-20  2005   16  I'm 16 years old

In [ ]:
def get_introduce_2(row):
  return "I was born in " + str(row.year) + " my age is " + str(row.age)

In [ ]:
df.introduce = df.apply(get_introduce_2, axis=1)

In [ ]:
df

   yyyy-mm-dd  year  age                        introduce
0  2000-06-27  2000   21  I was born in 2000 my age is 21
1  2002-09-24  2002   19  I was born in 2002 my age is 19
2  2005-12-20  2005   16  I was born in 2005 my age is 16

In [ ]:
df.columns = ['생년월일', '연도', '나이', '소개']
df

         생년월일    연도  나이                               소개
0  2000-06-27  2000  21  I was born in 2000 my age is 21
1  2002-09-24  2002  19  I was born in 2002 my age is 19
2  2005-12-20  2005  16  I was born in 2005 my age is 16